URL_INPUT_HELP = "Вы можете вставить до 50 ссылок. Все настройки будут общие для каждой ссылки\nСсылки будут" \
                 " обработаны в указанном порядке.\nВсе параметры вшитые в ссылку будут работать"
MIN_PRICE_HELP = "Минимальная цена. Если это неважно - ставьте 0"
MAX_PRICE_HELP = "Максимальная цена. Если это неважно - ставьте 999999999999"
KEYWORD_INPUT_HELP = "В названии или описании объявления обязательно должно встретиться одно из ключевых слов"
KEYWORD_BLACK_INPUT_HELP = "Если в названии или описании объявления будет одно из этих слов - объявление " \
                           "будет проигнорировано"
COUNT_PAGE_HELP = "Сколько страниц обрабатывать для каждой ссылки?"
PAUSE_SEC_HELP = "Пауза в секундах между повторной проверкой"
MAX_VIEW_HELP = "Если у объявления будет больше просмотров чем указано - то объявление будет проигнорировано. " \
                "Если что-то ввести - придется включить режим /Дополнительная информация/. Это удобно использовать, " \
                "чтобы отсеять старые объявления при первом запуске. Оставь здесь 0 или очисти поле - " \
                "если на просмотры всё равно"
TG_TOKEN_HELP = "Токен телеги, выдаётся при создании телеграм-канала"
TG_CHAT_ID_HELP = "Chat_id - id конкретно Вашей беседы, можно вставить несколько"
BTN_TEST_TG_HELP = "Если нужно проверить правильность введенных данных"
PROXY_HELP = "Прокси вот в таком формате username:password@server:port. Чтобы узнать больше кликни кнопку ниже"
PROXY_CHANGE_IP_HELP = "Ссылка на изменения ip прокси"
PROXY_BTN_HELP_HELP = "Жми не бойся"
GEO_HELP = "Если нужно фильтровать объявления по гео признаку. Проверяет есть ли введенное значение в строке адреса " \
           "найденного объявления. Если что-то ввести - придется включить режим /Дополнительная информация/"
NEED_MORE_INFO_HELP = "Если Вам нужны такие вещи как: адрес, полное описание, продавец, кол-во просмотров," \
                      " дата размещения то придется включить это. \nЭто увеличивает вероятность блокировки" \
                      "и снижает скорость, поэтому без прокси лучше не использовать. " \
                      "\nЕсли заполнены поля /Гео/ или /Макс. просмотров/ - это поле будет обязательно"
DEBUG_MODE_HELP = "Будет видно окно браузера и можно посмотреть, что там происходит. Иногда полезно чтобы понять" \
                  " почему ничего не работает"
SKIP_JS_HELP = "Если включено - скрипт не будет ждать полной загрузки страницы, а именно выполнения js кода.\n" \
               "Это сильно ускорит всю работу, но баны по IP будут чаще. Без прокси лучше не включать"
BUY_ME_COFFE_BTN_HELP = "Я старался написать полезную и при этом бесплатную программу (и даже этот текст). Если" \
                        " можешь поддержать - буду только рад"
REPORT_ISSUE_BTN_HELP = "Сообщить об ошибке"
BUY_PROXY_LINK = "Для стабильной работы парсера необходимы мобильные прокси, которые обеспечат доступ к практически" \
                 " неограниченному числу IP-адресов. \nВы можете использовать любые мобильные прокси (наверное)), " \
                 "но я рекомендую обратить внимание на mobileproxy, тестирование парсера проводилось именно на них." \
                 " \nПосле нажатия кнопки «Купить прокси» Вы попадёте на их сайт, где сможете приобрести прокси со " \
                 "скидкой 20% (скидка применится автоматически). \nПри покупке выберите регион 'Россия'\n PS: " \
                 "Нужен всего один! мобильный прокси "
TG_TEST_MSG = "Если сообщение пришло к Вам в telegram - значит всё настроено правильно. Если нет - результат парсинга" \
              " всегда можно посмотреть в папке result или ниже. Если Вы сейчас измените token или chat_id -" \
              " перезапустите парсер"
